{
  "backend/main.mo": "Main actor for the USDT P2P trading platform defining data types (profiles, wallets, orders, disputes, audit trails) and backend functions for profile management, KYC, orders, escrow, and disputes with role-based access control.",
  "backend/migration.mo": "Migration module that transforms legacy actor state by stripping PAN/Aadhaar fields from KycInfo and renaming kycVerified to verified in FullProfile records.",
  "feature_evidence.json": "Feature evidence report listing three implemented features: KYC page removal with static badge, payment details fields on sell order creation, and seller payment details display on order detail view.",
  "frontend-file-summaries.txt": "JSON map of frontend file paths to one-line summaries describing each file's role and recent changes in the codebase.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the React app with a root div and module script entry point, titled 'USDT P2P Trading Platform'.",
  "frontend/src/App.tsx": "Root React app defining TanStack Router route tree with auth guard, layout wrapper, and all page routes including the new /orders/$orderId detail route; KYC route removed.",
  "frontend/src/components/admin/OrderProfitTable.tsx": "Renders a table of completed orders with columns for order ID, USDT/INR amounts, profit, network, timestamp, and status, with loading skeleton and empty-state handling.",
  "frontend/src/components/admin/ProfitFilterBar.tsx": "Provides time-period (daily/weekly/monthly/all) and network (all/TRC20/BEP20) filter controls for the admin profit view using tabs and a select dropdown.",
  "frontend/src/components/admin/ProfitMetricsCard.tsx": "Displays a four-metric grid (total USDT traded, INR volume, platform profit, order count) with loading skeleton and highlight styling for key metrics.",
  "frontend/src/components/DisputeBadge.tsx": "Small badge component that renders a colored status pill (No Dispute, Buyer Dispute, or Seller Dispute) based on a DisputeStatus prop.",
  "frontend/src/components/EscrowStatusIndicator.tsx": "Step-progress indicator component visualizing the four escrow stages (locked, INR paid, admin verified, released) with icons and connecting lines.",
  "frontend/src/components/KycStatusBadge.tsx": "Static badge component that always displays 'Level 0 — Verified' with a ShieldCheck icon; dynamic KYC props have been removed.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application shell providing a sticky header with logo, desktop/mobile navigation for user and admin routes, and login/logout controls using Internet Identity.",
  "frontend/src/components/layout/DashboardCard.tsx": "A reusable card container with optional title, subtitle, icon, header action, and an accent border variant for consistent dashboard section styling.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects and validates a new user's username and email, then saves the profile via a mutation hook. It is non-dismissable, blocking interaction until the form is successfully submitted.",
  "frontend/src/components/RoleGuard.tsx": "A wrapper component that restricts rendering of children based on a role hierarchy (guest < user < admin), showing loading or access-denied states as appropriate.",
  "frontend/src/components/WalletBalanceCard.tsx": "Displays a user's available balance, escrow balance, and optionally an admin platform profit balance, along with a copyable TRC20 deposit address.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profiles, admin checks, KYC, wallets, orders, approvals, disputes, and audit trails.",
  "frontend/src/index.css": "Global stylesheet that imports Inter and JetBrains Mono fonts, sets up a dark financial (charcoal/amber) Tailwind CSS theme with custom CSS variables, and defines utility classes for glow effects and scrollbars.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with React Query's QueryClientProvider and the InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard page displaying platform profit and trading metrics with time/network filters, mock order data, and CSV export functionality, protected by RoleGuard for admin access.",
  "frontend/src/pages/admin/ApprovalsPage.tsx": "Admin page for reviewing user access requests, allowing admins to approve or reject users via the setApproval mutation, with status badges and loading states.",
  "frontend/src/pages/admin/AuditLogPage.tsx": "Admin audit log page that displays mock platform action entries with search and action-type filtering, formatted timestamps, and color-coded action labels.",
  "frontend/src/pages/admin/DisputeManagementPage.tsx": "Admin page for managing disputed orders, supporting actions like freezing orders/wallets, manually releasing USDT, and issuing refunds using mock dispute data.",
  "frontend/src/pages/admin/KycManagementPage.tsx": "Empty file with no content; KYC management page is not yet implemented.",
  "frontend/src/pages/admin/RoleManagementPage.tsx": "Admin page for assigning roles (admin, user, guest) to platform users fetched from the approvals list, with role permission descriptions and save functionality.",
  "frontend/src/pages/admin/WithdrawalLockPage.tsx": "Admin page that provides an emergency toggle switch to globally lock or unlock all platform withdrawals, with status indicators and toast notifications. Restricted to admin role via RoleGuard.",
  "frontend/src/pages/CreateSellOrderPage.tsx": "Page component for creating a USDT sell order, with form validation for amount, UPI ID, and bank details, and displays estimated INR payout after platform fees.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page showing the user's wallet balance, KYC status, approval status, and a prompt to request platform approval if not yet approved.",
  "frontend/src/pages/DisputePage.tsx": "Displays a user's active orders and allows them to raise buy/sell disputes via the `useRaiseDispute` hook, showing status badges and toast notifications for success/failure.",
  "frontend/src/pages/KycSubmissionPage.tsx": "Empty file with no content; KYC submission page is not yet implemented.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen with an Internet Identity authentication button, handling login/logout state and displaying feature highlights for security, speed, and privacy.",
  "frontend/src/pages/OrderBookPage.tsx": "Shows a mock order book of USDT sell listings with filtering and a buy action that currently displays a 'coming soon' toast since the backend order book is not yet implemented.",
  "frontend/src/pages/OrderDetailPage.tsx": "Displays order details and mock seller payment information (UPI, bank account, IFSC) with copy-to-clipboard fields, pending a real backend `getOrderDetails` endpoint.",
  "frontend/src/pages/WalletPage.tsx": "Provides a wallet management UI showing USDT balance and deposit/withdrawal forms, wired to `useDeposit` and `useWithdraw` hooks with a generated deposit address based on the user's principal.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting URL parameters from both regular query strings and hash-based routing, with helpers to persist/retrieve values via sessionStorage and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom color palettes (amber, charcoal, status colors using OKLCH), typography/container-queries/animate plugins, custom shadows, border radii, and keyframe animations.",
  "project_state.json": "Project state snapshot describing a USDT P2P trading platform's architecture, existing features, and known issues, used for build planning and tracking implementation progress across backend, frontend, and database layers."
}